efogdev/esp32-s3-efogtech-iskra/main/main.c
#include <string.h>
#include <math.h>
#include <stdlib.h>
#include "freertos/FreeRTOS.h"
#include "freertos/FreeRTOSConfig.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_system.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "protocol_examples_common.h"
#include "esp_tls.h"
#include "soc/soc_caps.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "driver/gpio.h"
#include "driver/dedic_gpio.h"
#include "adc_cali_interface.h"
#include <inttypes.h>
#include "esp_http_client.h"
#include "esp_http_server.h"
#include "driver/ledc.h"
#include "lwip/inet.h"
#include "esp_mac.h"
#include <sys/param.h>
#include "esp_ota_ops.h"
#include "esp_flash_partitions.h"
#include "esp_partition.h"
#include "driver/temperature_sensor.h"
#include "nvs.h"
#include "nvs_flash.h"
#include "const.c"
#include "esp_event.h"
#include "PID/PID.h"

static const char *TAG = "EFOGTECH";

static TaskHandle_t dns_task_handle = NULL;
static volatile int requestUsbPdVolts = 0;
static volatile int usbVrefVoltage = -1;
static volatile int usbVrefVoltageValue = -1;
static volatile int usbVrefVoltageMv = -1;
static char voltageString[24] = "";
static volatile int cc1 = -1, cc2 = -1;
static volatile int boardTemperature = -1;
static volatile int heaterTemperature = -1;
static volatile int heaterTemperatureC = -1;
static volatile int heaterPwm = 0;
static volatile int waterTemperature = -1;
static volatile int radiatorTemperature = -1;
static volatile int targetTemperature = 220;
static volatile int peltierValue = 0;
static volatile int fanValue = 0;
static uint32_t freeRam = 0;
static volatile bool isThinking = false;
static volatile bool isPDTesting = false;
static volatile bool isHeating = false;
static volatile bool isCooling = false;
static volatile bool pdCapable12 = false, pdCapable15 = false, pdCapable20 = false;
static volatile bool isWaitingForConnection = true;
static const int voltageThreshold = 1100;
temperature_sensor_handle_t temp_sensor = NULL;
static adc_cali_handle_t adc_cali_handle;

static esp_err_t start_file_server(httpd_handle_t);
static void makeAdcReads();
static void rgb_tick();
static void rgb_init();
static void ws_log(char*);

static volatile enum THINKING_REASON thinkingReason = REASON_DEFAULT;

#include "server.c"
#include "ws.c"
#include "ota.c"

#define PWM_FREQ 12000
#define PWM_RESOLUTION LEDC_TIMER_5_BIT
#define PWM_MAX 31
#define PWM_MODE LEDC_LOW_SPEED_MODE

#define REPORT_URL "http://efog.tech/api/batmon/update"

#define PWM_CHANNEL_HEAT LEDC_CHANNEL_0
#define PWM_CHANNEL_PELTIER LEDC_CHANNEL_1
#define PWM_CHANNEL_FAN LEDC_CHANNEL_2

#define RGB_FREQ 5000
#define RGB_RESOLUTION LEDC_TIMER_13_BIT
#define RGB_MAX 8191
#define RGB_CHANNEL_R LEDC_CHANNEL_3
#define RGB_CHANNEL_G LEDC_CHANNEL_4
#define RGB_CHANNEL_B LEDC_CHANNEL_5

#define TEMP_ADC_CHANNEL ADC_CHANNEL_5
#define WATER_TEMP_ADC_CHANNEL ADC_CHANNEL_4
#define RADIATOR_TEMP_ADC_CHANNEL ADC_CHANNEL_6
#define USB_VREF_ADC_CHANNEL ADC_CHANNEL_7

#define GPIO_RGB_R 10
#define GPIO_NUM_RGB_R GPIO_NUM_10

#define GPIO_RGB_G 11
#define GPIO_NUM_RGB_G GPIO_NUM_11

#define GPIO_RGB_B 12
#define GPIO_NUM_RGB_B GPIO_NUM_12

#define GPIO_FAN 13
#define GPIO_NUM_FAN GPIO_NUM_13

#define GPIO_HEAT 14
#define GPIO_NUM_HEAT GPIO_NUM_14

#define GPIO_PELTIER 21
#define GPIO_NUM_PELTIER GPIO_NUM_21

#define GPIO_TR 16
#define GPIO_NUM_TR GPIO_NUM_16

#define GPIO_TR_WATER 15
#define GPIO_NUM_TR_WATER GPIO_NUM_15

#define GPIO_TR_RADIATOR 7
#define GPIO_NUM_TR_RADIATOR GPIO_NUM_7

#define GPIO_USB_VREF 8
#define GPIO_NUM_USB_VREF GPIO_NUM_8

#define GPIO_USB_CC1_VREF 17
#define GPIO_NUM_USB_CC1_VREF GPIO_NUM_17

#define GPIO_USB_CC2_VREF 18
#define GPIO_NUM_USB_CC2_VREF GPIO_NUM_18

#define GPIO_LED_0 37
#define GPIO_NUM_LED_0 GPIO_NUM_37

#define GPIO_LED_1 48
#define GPIO_NUM_LED_1 GPIO_NUM_48

#define GPIO_LED_HEAT 46
#define GPIO_NUM_LED_HEAT GPIO_NUM_46

#define GPIO_RST_BTN 36
#define GPIO_NUM_RST_BTN GPIO_NUM_36

#define GPIO_PD_CFG2 1
#define GPIO_NUM_PD_CFG2 GPIO_NUM_1

#define GPIO_PD_CFG3 2
#define GPIO_NUM_PD_CFG3 GPIO_NUM_2

#define MAX_HTTP_RECV_BUFFER 512
#define MAX_HTTP_OUTPUT_BUFFER 2048

static adc_oneshot_unit_handle_t adc1_handle;
static adc_oneshot_unit_handle_t adc2_handle;
static httpd_handle_t webserver;

static void setThinking(enum THINKING_REASON reason, bool think) {
    if (think) {
        thinkingReason = reason;
        isThinking = true;
        return;
    }

    if (!think && thinkingReason == reason) {
        isThinking = false;
    }
}

static void pdTest() {
    isPDTesting = true;
}

static httpd_handle_t getServer() {
    return webserver;
}

esp_err_t _http_event_handler(esp_http_client_event_t *evt)
{
    switch(evt->event_id) {
        case HTTP_EVENT_ERROR:
        case HTTP_EVENT_ON_CONNECTED:
        case HTTP_EVENT_HEADER_SENT:
        case HTTP_EVENT_ON_HEADER:
        case HTTP_EVENT_ON_FINISH:
        case HTTP_EVENT_ON_DATA:
        case HTTP_EVENT_DISCONNECTED:
        case HTTP_EVENT_REDIRECT:
            break;    
    }
    return ESP_OK;
}

static void setConnected() {
    isWaitingForConnection = false;
    set_rgb_stage(RGB_STAGE_IDLE);
}

static void setPD(int volts) {
    requestUsbPdVolts = volts;

    vTaskDelay(pdMS_TO_TICKS(64));
}

static void setTargetTemperature(int temp) {
    targetTemperature = temp;
}

static void startHeating() {
    isHeating = true;

    ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, PWM_MAX);
    ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);
}

static void disable_all() {
    isCooling = false;
    isHeating = false;
    fanValue = 0;

    ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, 0);
    ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);

    gpio_set_level(GPIO_NUM_PELTIER, 0);
    gpio_set_level(GPIO_NUM_HEAT, 0);
    gpio_set_level(GPIO_NUM_FAN, 0);
}

static void stopHeating() {
    isHeating = false;

    ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, 0);
    ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);
}

static void toggleHeating() {
    isHeating = !isHeating;

    if (isHeating) {
        startHeating();
    } else {
        stopHeating();
    }
}

static void startCooling() {
    fanValue = PWM_MAX;
    isCooling = true;
}

static void stopCooling() {
    isCooling = false;

    fanValue = 0;
}

