efogdev/esp32-s3-efogtech-iskra/main/main.c
            pdCapable15 = true;
            nvs_set_u8(nvs, "vcc15", 1);

            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 0);
            vTaskDelay(pdMS_TO_TICKS(400));

            pdCapable20 = true;
            nvs_set_u8(nvs, "vcc20", 1);

            if (pdCapable15) {
                setPD(15);
            } else {
                setPD(12);
            }

            nvs_set_u8(nvs, "pd_tested", 0);
            setThinking(REASON_TEST, false);
            isPDTesting = false;

            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }

        if (vbuffer_index > 0) {
            int count = 0, sum = 0;
            for (int i = 0; i < vbuffer_index; i++) {
                int value = voltageBuffer[i];

                if (value > 0) {
                    count++;
                    sum += value;
                }
            }

            averageVoltageRaw = sum / count;
        }

        if (averageVoltageRaw > 0) {
            int percentChange = 100 - (usbVrefVoltageValue * 100 / averageVoltageRaw);

            if (percentChange < -5) {
                char text[64];
                sprintf(text, "Voltage peak? Vraw_avg: %d, Vraw: %d", averageVoltageRaw, usbVrefVoltageValue);
                ws_log(text);
            }

            if (percentChange > 5) {
                char text[64];
                sprintf(text, "Voltage drop! Vraw_avg = %d, Vraw = %d", averageVoltageRaw, usbVrefVoltageValue);
                ws_log(text);

                voltageWarning = true;

                if (isHeating) {
                    stopHeating();
                    vTaskDelay(pdMS_TO_TICKS(250));
                    startHeating();
                }

                vTaskDelay(pdMS_TO_TICKS(1400));
                voltageWarning = false;
            }
        }

        if (requestUsbPdVolts == actualValue) {
            vTaskDelay(pdMS_TO_TICKS(128));
            continue;
        }

        setThinking(REASON_PD, true);

        actualValue = requestUsbPdVolts;
        vTaskDelay(pdMS_TO_TICKS(12));

        // 0 1   12V
        // 1 1   15V
        // 1 0   20V

        if (requestUsbPdVolts == 12) {
            gpio_set_level(GPIO_NUM_PD_CFG2, 0);
            gpio_set_level(GPIO_NUM_PD_CFG3, 1);
        } else if (requestUsbPdVolts == 15) {
            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 1);
        } else if (requestUsbPdVolts == 20) {
            gpio_set_level(GPIO_NUM_PD_CFG2, 1);
            gpio_set_level(GPIO_NUM_PD_CFG3, 0);
        }

        vTaskDelay(pdMS_TO_TICKS(250));
        setThinking(REASON_PD, false);
    }
}

static float kp = 2.12, ki = 0.74, kd = 1.6;
static float pid_input = 0, pid_output = PWM_MAX - 1, pid_setpoint = 0;

static struct pid_controller pid_ctrl_data;
static pid_ctrl_t pid;

static void heater_task(void *pvParameters) {
    pid = pid_create(&pid_ctrl_data, &pid_input, &pid_output, &pid_setpoint, kp, ki, kd);
    pid_limits(pid, 0, PWM_MAX - 1);
    pid_auto(pid);

    while (1) {
        float ntcResistance = 5600 * (1 / (3.3 / ((3.3 * heaterTemperature) / 4096) - 1));

        float temperature;
        temperature = ntcResistance / 100000;
        temperature = log(temperature);
        temperature /= 3950;
        temperature += 1.0 / (25 + 273.15);
        temperature = 1.0 / temperature;
        temperature -= 273.15;

        heaterTemperatureC = temperature;

        if (!isPDTesting) {
            if (isHeating && (usbVrefVoltage > voltageThreshold)) {
                pid_setpoint = targetTemperature;

                if (pid_need_compute(pid)) {
                    pid_input = temperature;
                    pid_compute(pid);

                    heaterPwm = pid_output;
                }

                ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, heaterPwm);
                ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);
            } else {
                ledc_set_duty(PWM_MODE, PWM_CHANNEL_HEAT, 0);
                ledc_update_duty(PWM_MODE, PWM_CHANNEL_HEAT);

                heaterPwm = 0;
            }
        }

        vTaskDelay(pdMS_TO_TICKS(256));
    }
}

static void report_task(void *pvParameters) {
    while (1) {
        if (!webserver) {
            vTaskDelay(pdMS_TO_TICKS(128));
            continue;
        }

        char buf[640];
        sprintf(buf,
            "{\"type\":\"update\",\"content\":{\"isHeating\":%s,\"temperature\":\"%d\",\"coolingTemperature\":\"%d\",\"voltage\":\"%s\",\"isVoltageOk\":%s,\"isCooling\":%s,\"boardTemperature\":\"%d\",\"heaterPower\":\"%d\",\"coolerPower\":\"%d\",\"fanPower\":\"%d\",\"freeRam\":\"%d\",\"voltageRaw\":\"%d\",\"isServerThinking\":%s,\"12V\":%s,\"15V\":%s,\"20V\":%s,\"speed\":%d,\"brightness\":%d,\"rgbCurrentFn\":%d}}",
            isHeating ? "true" : "false", // isHeating
            (int) heaterTemperatureC, // temperature, C
            (int) waterTemperature, // radiator temp ADC raw data
            voltageString, // voltage
            (!voltageWarning && (usbVrefVoltage > voltageThreshold)) ? "true" : "false", // isVoltageOk
            isCooling ? "true" : "false", // isCooling
            (int) boardTemperature, // board temp, C
            isHeating ? (int) (((float) heaterPwm / PWM_MAX) * 100) : 0, // heater %
            isCooling ? (int) (((float) peltierValue / PWM_MAX) * 100) : 0, // cooler %
            (int) (((float) fanValue / PWM_MAX) * 100), // fan %
            (int) freeRam / 1000, // free RAM, kb
            (int) usbVrefVoltage, // raw voltage data
            isThinking ? "true" : "false",
            pdCapable12 ? "true" : "false",
            pdCapable15 ? "true" : "false",
            pdCapable20 ? "true" : "false",
            rgbSpeed,
            rgbPower,
            rgbFn
        );

        httpd_ws_frame_t pkt;
        memset(&pkt, 0, sizeof(httpd_ws_frame_t));
        pkt.payload = (uint8_t *) buf;
        pkt.type = HTTPD_WS_TYPE_TEXT;
        pkt.len = strlen(buf);

        ws_send_frame_to_all_clients(&pkt, webserver);
        makeAdcReads();

        vTaskDelay(pdMS_TO_TICKS(160));
    }
}

