efogdev/esp32-s3-efogtech-iskra/main/main.c
void app_main(void)
{
    gpio_config_t io_conf = {};
    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_OUTPUT;
    io_conf.pin_bit_mask = (
        (1ULL << GPIO_NUM_HEAT)
        | (1ULL << GPIO_NUM_PELTIER)
        | (1ULL << GPIO_NUM_RGB_R)
        | (1ULL << GPIO_NUM_RGB_G)
        | (1ULL << GPIO_NUM_RGB_B)
        | (1ULL << GPIO_NUM_LED_0)
        | (1ULL << GPIO_NUM_LED_1)
        | (1ULL << GPIO_NUM_LED_HEAT)
        | (1ULL << GPIO_NUM_FAN)
    );
    io_conf.pull_down_en = 1;
    io_conf.pull_up_en = 0;
    gpio_config(&io_conf);

    io_conf.pin_bit_mask = (
        (1ULL << GPIO_NUM_PD_CFG2) |
        (1ULL << GPIO_NUM_PD_CFG3)
    );
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 1;
    gpio_config(&io_conf);

    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = 1ULL << GPIO_NUM_USB_VREF;
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 0;
    gpio_config(&io_conf);

    io_conf.intr_type = GPIO_INTR_DISABLE;
    io_conf.mode = GPIO_MODE_INPUT;
    io_conf.pin_bit_mask = (
        (1ULL << GPIO_NUM_TR) |
        (1ULL << GPIO_NUM_TR_WATER) |
        (1ULL << GPIO_NUM_TR_RADIATOR)
    );
    io_conf.pull_down_en = 0;
    io_conf.pull_up_en = 1;
    gpio_config(&io_conf);

    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

    ESP_LOGI(TAG, "Init emergency");
    xTaskCreate(&call_911_task, "call_911_task", 1024, NULL, 3, NULL);

    ESP_LOGI(TAG, "Init ADC");
    initAdc();

    ESP_LOGI(TAG, "Init PWM");
    initPwm();

    ESP_LOGI(TAG, "Init PD");
    xTaskCreate(&pd_task, "pd_task", 4400, NULL, 11, NULL);

    ESP_LOGI(TAG, "Init RGB");
    rgb_init();
    xTaskCreate(&rgb_task, "rgb_task", 5600, NULL, 12, NULL);

    ESP_LOGI(TAG, "Init wireless");
    initWifi();

    ESP_LOGI(TAG, "Init server");
    webserver = start_webserver();

    ESP_LOGI(TAG, "Init report service");
    xTaskCreate(&report_task, "report_task", 5600, NULL, 6, NULL);

    ESP_LOGI(TAG, "Init heater service");
    xTaskCreate(&heater_task, "heater_task", 5600, NULL, 9, NULL);

    ESP_LOGI(TAG, "Initialization successful");
}
